Reports/Прогноз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Прогноз</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТурКод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОчков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фазы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТурКод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Противник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фаза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФазаП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Матч</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Матч</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ПеремещенияИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПеремещенияИгроков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Амплуа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Амплуа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Матч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Матч</Name>
			<BasedOn>
				<xr:Item>Catalog.Стадионы</xr:Item>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТурнирнаяТаблица</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стадионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗрителей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗрителей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пенальти</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Игрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Лига.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Лига</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыСпорта</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Страны</xr:Item>
				<xr:Item>Catalog.ВидыСпорта</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоКоманд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРотация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОлимпийскаяСистема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квалификация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/Прогноз/Ext/ObjectModule.bsl
Функция ОтчетСформировать(Отчет=Неопределено, Все=Ложь) Экспорт
	Если Отчет = Неопределено Тогда Отчет = ЭтотОбъект; КонецЕсли;
	
	ОлимпийскаяСистема	= Чемпионат.Владелец.ОлимпийскаяСистема;
	Все					= (Все И ОлимпийскаяСистема = Ложь);
	Отчет.Данные.Очистить();
	Отчет.Фазы.Очистить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда Возврат ТабДокумент; КонецЕсли;
	
	ТабДокумент.Вывести(ЗаголовокПолучить());
	Макет	= ПолучитьОбщийМакет("ТурнирнаяТаблица");
	
	ТабДокумент.Вывести(Макет.ПолучитьОбласть(?(ОлимпийскаяСистема, "Шапка4|НачалоП", "Шапка1|Начало")));
	
	ПоказыватьРазницуМячей = ПоказыватьРазницуМячей();
	Итого	= Новый Структура("Место,КоличествоОчков", 0, 0);
	
	Выборка	= ДанныеПолучить(Все);
	
	Туры	= Новый Массив;
	ТурМакс	= 1;
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка|LL");
	Для Каждого ТекущаяСтрока Из Выборка Цикл
		Если Туры.Найти(ТекущаяСтрока.Тур) = Неопределено Тогда
			Туры.Добавить(ТекущаяСтрока.Тур);
			
			ОбластьМакета.Параметры.Заполнить(ТекущаяСтрока);
			ТабДокумент.Присоединить(ОбластьМакета);
			
			ТурМакс	= Макс(ТурМакс, ТекущаяСтрока.ТурКод);
		КонецЕсли;
	КонецЦикла;
	мКлубы	= Новый Массив;
	Если ОлимпийскаяСистема Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	МатчКоманды.Команда КАК Команда
		                      |ИЗ
		                      |	Документ.Матч.Команды КАК МатчКоманды
		                      |ГДЕ
		                      |	МатчКоманды.Ссылка.ПометкаУдаления = ЛОЖЬ
		                      |	И МатчКоманды.Ссылка.Тур В(&Туры)
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Команда
		                      |АВТОУПОРЯДОЧИВАНИЕ");
		Запрос.УстановитьПараметр("Туры",				Туры);
		мКлубы	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	Иначе
		ТабДокумент.Присоединить(Макет.ПолучитьОбласть("Шапка|NN"));
	КонецЕсли;
	
	Команды	= ТурнирнаяТаблица();
	
	ТурМин	= 99;
	Пока Команды.Следующий() Цикл
		ТурМин = Мин(ТурМин, Команды.КоличествоИгр);
	КонецЦикла;
	Команды.Сбросить();
	
	Пока Команды.Следующий() Цикл
		Если ОлимпийскаяСистема И мКлубы.Найти(Команды.Команда) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Итого.Место	= Итого.Место + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть(?(ОлимпийскаяСистема, "Детали4|НачалоП", "Детали1|Начало"));
		ОбластьМакета.Параметры.Заполнить(Команды);
		Если НЕ ПоказыватьРазницуМячей Тогда
			ОбластьМакета.Параметры.Разница	= СтрШаблон("%1-%2", Команды.КоличествоЗабито, Команды.КоличествоПропущено);
		КонецЕсли;
		ОбластьМакета.Параметры.Место	= Итого.Место;
		ТабДокумент.Вывести(ОбластьМакета);
		
		Итого.КоличествоОчков	= Команды.КоличествоОчков;
		Пустота			= (НЕ ОлимпийскаяСистема);
		Для Каждого ТекущаяСтрока Из Выборка Цикл
			Если ТекущаяСтрока.Команда = Команды.Команда Или ТекущаяСтрока.Противник = Команды.Команда Тогда
				Пустота	= Ложь;
				Для Каждого Тур Из Туры Цикл
					мСтроки	= Выборка.НайтиСтроки(Новый Структура("Команда,Тур", Команды.Команда, Тур));
					Если мСтроки.Количество() = 0 Тогда
						мСтроки	= Выборка.НайтиСтроки(Новый Структура("Противник,Тур", Команды.Команда, Тур));
						Если мСтроки.Количество() = 0 Тогда
							ТабДокумент.Присоединить(Макет.ПолучитьОбласть("Детали|NN"));
							Продолжить;
						Иначе
							ТекСтрока	= мСтроки.Получить(0);
							ОбластьМакета = Макет.ПолучитьОбласть("Детали2|" + Результат(ТекСтрока.КоличествоОчков, Истина));
							Если ТекСтрока.КоличествоЗабито < 0 Тогда
								ОбластьМакета.Параметры.Аббревиатура	= ?(ПустаяСтрока(ТекСтрока.Аббревиатура), ВРег(Лев(ТекСтрока.Команда, 3)), ТекСтрока.Аббревиатура) + "(A)";
								Итого.КоличествоОчков = Итого.КоличествоОчков + ?(ТекСтрока.КоличествоОчков=1, 1, ?(ТекСтрока.КоличествоОчков=0, 3, 0));
							Иначе
								ОбластьМакета.Параметры.Аббревиатура	= СтрШаблон("%1-%2", ТекСтрока.КоличествоПропущено, ТекСтрока.КоличествоЗабито);
							КонецЕсли;
						КонецЕсли;
					Иначе
						ТекСтрока	= мСтроки.Получить(0);
						ОбластьМакета = Макет.ПолучитьОбласть("Детали2|" + Результат(ТекСтрока.КоличествоОчков));
						Если ТекСтрока.КоличествоЗабито < 0 Тогда
							ОбластьМакета.Параметры.Аббревиатура	= ?(ПустаяСтрока(ТекСтрока.АббревиатураП), ВРег(Лев(ТекСтрока.Противник, 3)), ТекСтрока.АббревиатураП) + "(H)";
							Итого.КоличествоОчков = Итого.КоличествоОчков + ТекСтрока.КоличествоОчков;
							
							ЗаполнитьЗначенияСвойств(Отчет.Фазы.Добавить(), ТекСтрока);
						Иначе
							ОбластьМакета.Параметры.Аббревиатура	= СтрШаблон("%1-%2", ТекСтрока.КоличествоЗабито, ТекСтрока.КоличествоПропущено);
						КонецЕсли;
					КонецЕсли;
					ОбластьМакета.Параметры.Регистратор		= ТекСтрока.Матч;
					ТабДокумент.Присоединить(ОбластьМакета);
				КонецЦикла;
				Если НЕ ОлимпийскаяСистема Тогда
					ОбластьМакета	= Макет.ПолучитьОбласть("Детали|NN");
					ОбластьМакета.Параметры.КоличествоОчков	= Итого.КоличествоОчков;
					ТабДокумент.Присоединить(ОбластьМакета);
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Пустота Тогда
			ОбластьМакета	= Макет.ПолучитьОбласть("Детали|NN");
			Для Итератор = 1 По Туры.Количество() Цикл
				ТабДокумент.Присоединить(ОбластьМакета);
			КонецЦикла;
			ОбластьМакета.Параметры.КоличествоОчков	= 0;
			ТабДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Новый Структура("Команда,ТурКод,КоличествоОчков",
			Команды.Команда, ТурМин, Команды.КоличествоОчков));
		ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Новый Структура("Команда,ТурКод,КоличествоОчков",
			Команды.Команда, ТурМакс, Итого.КоличествоОчков - Команды.КоличествоОчков));
	КонецЦикла;
	
	ТабДокумент.ФиксацияСверху	= 3;
	ТабДокумент.ФиксацияСлева	= 10;
	
	Возврат ТабДокумент;
КонецФункции

Функция Результат(КоличествоОчков, Реверс=Ложь)
	Если Реверс Тогда Возврат ?(КоличествоОчков=0, "WW", ?(КоличествоОчков=1, "DD", "LL")); КонецЕсли;
	Возврат ?(КоличествоОчков=0, "LL", ?(КоличествоОчков=1, "DD", "WW"));
КонецФункции

Функция ДанныеПолучить(Все)
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
	      	               |	Матч.Тур КАК Тур,
	      	               |	Матч.Тур.Код КАК ТурКод
	      	               |ИЗ
	      	               |	Документ.Матч КАК Матч
	      	               |ГДЕ
	      	               |	Матч.Дата >= &Дата
	      	               |	И Матч.Проведен = ЛОЖЬ
	      	               |	И Матч.ПометкаУдаления = ЛОЖЬ
	      	               |	И Матч.Тур.Владелец = &Чемпионат
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ТурКод");
	Если Все Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Матч.Тур КАК Тур
		               |ИЗ
		               |	Документ.Матч КАК Матч
		               |ГДЕ
		               |	Матч.Дата >= &Дата
		               |	И Матч.Проведен = ЛОЖЬ
		               |	И Матч.ПометкаУдаления = ЛОЖЬ
		               |	И Матч.Тур.Владелец = &Чемпионат";
	КонецЕсли;
	Запрос.УстановитьПараметр("Чемпионат",			Чемпионат);
	Запрос.УстановитьПараметр("Дата",				НачалоДня(ТекущаяУниверсальнаяДата()));
	Запрос.УстановитьПараметр("Туры",				Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	Запрос.Текст = "ВЫБРАТЬ
	               |	МатчКоманды.Ссылка КАК Ссылка,
	               |	НАЧАЛОПЕРИОДА(МатчКоманды.Ссылка.Дата, ДЕНЬ) КАК Дата,
	               |	МатчКоманды.Ссылка.Тур КАК Тур,
	               |	МатчКоманды.Ссылка.Тур.Код КАК ТурКод,
	               |	МатчКоманды.Команда КАК Команда,
	               |	ЕСТЬNULL(Топы.Корреляция, 0) КАК Корреляция,
	               |	МатчКоманды.НомерСтроки КАК НомерСтроки,
	               |	МатчКоманды.Ссылка.Тур.ОлимпийскаяСистема КАК ОлимпийскаяСистема
	               |ПОМЕСТИТЬ Клубы
	               |ИЗ
	               |	Документ.Матч.Команды КАК МатчКоманды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |			ЛигаКоманды.Команда КАК Команда,
	               |			1 КАК Корреляция
	               |		ИЗ
	               |			Справочник.Лига.Команды КАК ЛигаКоманды
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	               |				ПО ЛигаКоманды.Ссылка = Чемпионаты.Владелец
	               |		ГДЕ
	               |			Чемпионаты.Ссылка = &Чемпионат) КАК Топы
	               |		ПО МатчКоманды.Команда = Топы.Команда
	               |ГДЕ
	               |	МатчКоманды.Ссылка В
	               |			(ВЫБРАТЬ
	               |				МатчКоманды.Ссылка
	               |			ИЗ
	               |				Документ.Матч.Команды КАК МатчКоманды
	               |			ГДЕ
	               |				МатчКоманды.Ссылка.Тур В (&Туры)
	               |				И МатчКоманды.Ссылка.Проведен = ЛОЖЬ
	               |				И МатчКоманды.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |			СГРУППИРОВАТЬ ПО
	               |				МатчКоманды.Ссылка
	               |			ИМЕЮЩИЕ
	               |				МАКСИМУМ(МатчКоманды.НомерСтроки) = 2)
	               |	И МатчКоманды.Команда В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				Перемещения.Команда
	               |			ИЗ
	               |				РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ГОД(Игрок.ДатаРождения) >= 1900) КАК Перемещения
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК Чемпионаты
	               |					ПО
	               |						Перемещения.Команда = Чемпионаты.Команда
	               |			ГДЕ
	               |				Чемпионаты.Ссылка = &Чемпионат
	               |			СГРУППИРОВАТЬ ПО
	               |				Перемещения.Команда
	               |			ИМЕЮЩИЕ
	               |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Перемещения.Игрок) >= 11)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПеремещенияИгроков.Игрок КАК Игрок,
	               |	ПеремещенияИгроков.Игрок.ДатаРождения КАК ДатаРождения,
	               |	ПеремещенияИгроков.Команда КАК Команда,
	               |	ВЫБОР
	               |		КОГДА (МатчСоставыКоманд.Игрок ЕСТЬ NULL) = ЛОЖЬ
	               |			ТОГДА 2
	               |		КОГДА ПеремещенияИгроков.Игрок.ПометкаУдаления = ЛОЖЬ
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Порядок
	               |ПОМЕСТИТЬ Игроки
	               |ИЗ
	               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ГОД(Игрок.ДатаРождения) >= 1900) КАК ПеремещенияИгроков
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МатчСоставыКоманд.Игрок КАК Игрок,
	               |			МатчСоставыКоманд.Команда КАК Команда
	               |		ИЗ
	               |			Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	               |		ГДЕ
	               |			МатчСоставыКоманд.Игрок.ПометкаУдаления = ЛОЖЬ
	               |			И (МатчСоставыКоманд.Ссылка.Дата, МатчСоставыКоманд.Команда) В
	               |					(ВЫБРАТЬ
	               |						МАКСИМУМ(Составы.Ссылка.Дата),
	               |						Составы.Команда
	               |					ИЗ
	               |						Документ.Матч.СоставыКоманд КАК Составы
	               |					ГДЕ
	               |						Составы.Ссылка.Тур.Владелец = &Чемпионат
	               |					СГРУППИРОВАТЬ ПО
	               |						Составы.Команда
	               |					ИМЕЮЩИЕ
	               |						КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Составы.Игрок) >= 11)) КАК МатчСоставыКоманд
	               |		ПО ПеремещенияИгроков.Игрок = МатчСоставыКоманд.Игрок
	               |			И ПеремещенияИгроков.Команда = МатчСоставыКоманд.Команда
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Клубы КАК Клубы
	               |		ПО ПеремещенияИгроков.Команда = Клубы.Команда
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Команда КАК Команда,
	               |	ВТ.Игрок КАК Игрок,
	               |	ВТ.Дата КАК Дата,
	               |	ВТ.Корреляция КАК Корреляция,
	               |	ОКР(ВЫБОР
	               |			КОГДА ВТ.Фаза1 <= 23 / 4
	               |				ТОГДА ВТ.Фаза1 * 25 / 23
	               |			КОГДА ВТ.Фаза1 <= 23 / 2
	               |				ТОГДА (23 / 4 - (ВТ.Фаза1 - 23 / 4)) * 25 / 23
	               |			КОГДА ВТ.Фаза1 <= 23 / 4 * 3
	               |				ТОГДА -(ВТ.Фаза1 - 23 / 2) * 25 / 23
	               |			ИНАЧЕ -(23 / 4 - (ВТ.Фаза1 - 23 / 4 * 3)) * 25 / 23
	               |		КОНЕЦ, 1) КАК Фаза1,
	               |	ОКР(ВЫБОР
	               |			КОГДА ВТ.Фаза2 <= 28 / 4
	               |				ТОГДА ВТ.Фаза2 * 25 / 28
	               |			КОГДА ВТ.Фаза2 <= 28 / 2
	               |				ТОГДА (28 / 4 - (ВТ.Фаза2 - 28 / 4)) * 25 / 28
	               |			КОГДА ВТ.Фаза2 <= 28 / 4 * 3
	               |				ТОГДА -(ВТ.Фаза2 - 28 / 2) * 25 / 28
	               |			ИНАЧЕ -(28 / 4 - (ВТ.Фаза2 - 28 / 4 * 3)) * 25 / 28
	               |		КОНЕЦ, 1) КАК Фаза2,
	               |	ОКР(ВЫБОР
	               |			КОГДА ВТ.Фаза3 <= 33 / 4
	               |				ТОГДА ВТ.Фаза3 * 25 / 33
	               |			КОГДА ВТ.Фаза3 <= 33 / 2
	               |				ТОГДА (33 / 4 - (ВТ.Фаза3 - 33 / 4)) * 25 / 33
	               |			КОГДА ВТ.Фаза3 <= 33 / 4 * 3
	               |				ТОГДА -(ВТ.Фаза3 - 33 / 2) * 25 / 33
	               |			ИНАЧЕ -(33 / 4 - (ВТ.Фаза3 - 33 / 4 * 3)) * 25 / 33
	               |		КОНЕЦ, 1) КАК Фаза3,
	               |	ВТ.Тур КАК Тур
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		Клубы.Команда КАК Команда,
	               |		Клубы.Дата КАК Дата,
	               |		ВЫБОР
	               |			КОГДА Клубы.НомерСтроки = 1
	               |					И Клубы.ОлимпийскаяСистема = ЛОЖЬ
	               |				ТОГДА 9.34
	               |			ИНАЧЕ 9
	               |		КОНЕЦ + Клубы.Корреляция КАК Корреляция,
	               |		Игроки.Игрок КАК Игрок,
	               |		РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) / 23) КАК Фаза1,
	               |		РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) / 28) КАК Фаза2,
	               |		РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, Клубы.Дата, ДЕНЬ) / 33) КАК Фаза3,
	               |		Клубы.Тур КАК Тур
	               |	ИЗ
	               |		Игроки КАК Игроки
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Клубы КАК Клубы
	               |			ПО Игроки.Команда = Клубы.Команда
	               |	ГДЕ
	               |		(Игроки.Команда, Игроки.Порядок) В
	               |				(ВЫБРАТЬ
	               |					Игроки.Команда,
	               |					МАКСИМУМ(Игроки.Порядок)
	               |				ИЗ
	               |					Игроки
	               |				СГРУППИРОВАТЬ ПО
	               |					Игроки.Команда)) КАК ВТ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Матчи.Ссылка КАК Матч,
	               |	Матчи.Тур КАК Тур,
	               |	Матчи.Тур.Код КАК ТурКод,
	               |	Матчи.Команда КАК Команда,
	               |	Матчи.Команда.Аббревиатура КАК Аббревиатура,
	               |	ВЫБОР
	               |		КОГДА ВТ.Фаза1 + ВТ.Фаза2 + ВТ.Фаза3 + ВТ.Корреляция - ВТ2.Фаза1 - ВТ2.Фаза2 - ВТ2.Фаза3 - ВТ2.Корреляция >= 5
	               |			ТОГДА 3
	               |		КОГДА ВТ.Фаза1 + ВТ.Фаза2 + ВТ.Фаза3 + ВТ.Корреляция - ВТ2.Фаза1 - ВТ2.Фаза2 - ВТ2.Фаза3 - ВТ2.Корреляция <= -5
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК КоличествоОчков,
	               |	-1 КАК КоличествоЗабито,
	               |	Противники.Команда КАК Противник,
	               |	Противники.Команда.Аббревиатура КАК АббревиатураП,
	               |	-1 КАК КоличествоПропущено,
	               |	ОКР(ВТ.Фаза1 + ВТ.Фаза2 + ВТ.Фаза3 + ВТ.Корреляция, 1) КАК Фаза,
	               |	ОКР(ВТ2.Фаза1 + ВТ2.Фаза2 + ВТ2.Фаза3 + ВТ2.Корреляция, 1) КАК ФазаП
	               |ИЗ
	               |	Клубы КАК Матчи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТ.Тур КАК Тур,
	               |			ВТ.Дата КАК Дата,
	               |			ВТ.Команда КАК Команда,
	               |			СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза1) КАК Фаза1,
	               |			СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза2 * 1.2) КАК Фаза2,
	               |			СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза3 * 1.1) КАК Фаза3,
	               |			СУММА(ВЫБОР
	               |					КОГДА ВТ.Фаза1 >= 1
	               |							И ВТ.Фаза2 >= 1
	               |							И ВТ.Фаза3 >= 1
	               |						ТОГДА 1
	               |					КОГДА ВТ.Фаза1 <= -1
	               |							И ВТ.Фаза2 <= -1
	               |							И ВТ.Фаза3 <= -1
	               |						ТОГДА -1
	               |					ИНАЧЕ 0
	               |				КОНЕЦ) + ЦЕЛ(КОЛИЧЕСТВО(ВЫБОР
	               |						КОГДА ВТ.Фаза1 > 0
	               |								И ВТ.Фаза2 > 0
	               |								И ВТ.Фаза3 > 0
	               |							ТОГДА 1
	               |						КОГДА ВТ.Фаза1 < 0
	               |								И ВТ.Фаза2 < 0
	               |								И ВТ.Фаза3 < 0
	               |							ТОГДА -1
	               |						ИНАЧЕ 0
	               |					КОНЕЦ) * 0.34) КАК Корреляция
	               |		ИЗ
	               |			ВТ КАК ВТ
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТ.Команда,
	               |			ВТ.Тур,
	               |			ВТ.Дата) КАК ВТ
	               |		ПО Матчи.Дата = ВТ.Дата
	               |			И Матчи.Команда = ВТ.Команда
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Клубы КАК Противники
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ВТ.Тур КАК Тур,
	               |				ВТ.Дата КАК Дата,
	               |				ВТ.Команда КАК Команда,
	               |				СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза1) КАК Фаза1,
	               |				СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза2 * 1.2) КАК Фаза2,
	               |				СРЕДНЕЕ(ВТ.Корреляция + ВТ.Фаза3 * 1.1) КАК Фаза3,
	               |				СУММА(ВЫБОР
	               |						КОГДА ВТ.Фаза1 >= 1
	               |								И ВТ.Фаза2 >= 1
	               |								И ВТ.Фаза3 >= 1
	               |							ТОГДА 1
	               |						КОГДА ВТ.Фаза1 <= -1
	               |								И ВТ.Фаза2 <= -1
	               |								И ВТ.Фаза3 <= -1
	               |							ТОГДА -1
	               |						ИНАЧЕ 0
	               |					КОНЕЦ) + ЦЕЛ(КОЛИЧЕСТВО(ВЫБОР
	               |							КОГДА ВТ.Фаза1 > 0
	               |									И ВТ.Фаза2 > 0
	               |									И ВТ.Фаза3 > 0
	               |								ТОГДА 1
	               |							КОГДА ВТ.Фаза1 < 0
	               |									И ВТ.Фаза2 < 0
	               |									И ВТ.Фаза3 < 0
	               |								ТОГДА -1
	               |							ИНАЧЕ 0
	               |						КОНЕЦ) * 0.34) КАК Корреляция
	               |			ИЗ
	               |				ВТ КАК ВТ
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ВТ.Команда,
	               |				ВТ.Тур,
	               |				ВТ.Дата) КАК ВТ2
	               |			ПО Противники.Дата = ВТ2.Дата
	               |				И Противники.Команда = ВТ2.Команда
	               |		ПО Матчи.Ссылка = Противники.Ссылка
	               |ГДЕ
	               |	Матчи.НомерСтроки = 1
	               |	И Противники.НомерСтроки = 2
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТурнирнаяТаблица.Регистратор,
	               |	ТурнирнаяТаблица.Тур,
	               |	ТурнирнаяТаблица.Тур.Код,
	               |	ТурнирнаяТаблица.Команда,
	               |	ТурнирнаяТаблица.Команда.Аббревиатура,
	               |	ТурнирнаяТаблица.КоличествоОчков,
	               |	ТурнирнаяТаблица.КоличествоГолов,
	               |	Противники.Команда,
	               |	Противники.Команда.Аббревиатура,
	               |	Противники.КоличествоГолов,
	               |	0,
	               |	0
	               |ИЗ
	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
	               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
	               |ГДЕ
	               |	ТурнирнаяТаблица.Тур В(&Туры)
	               |	И ТурнирнаяТаблица.НомерСтроки = 1
	               |	И Противники.НомерСтроки = 2
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Тур,
	               |	Матч,
	               |	КоличествоЗабито УБЫВ";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ЗаголовокПолучить()
	Возврат СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат,ВыводитьЧемпионат", Чемпионат.Владелец, Чемпионат, Ложь));
КонецФункции

Функция ТурнирнаяТаблица()
	Возврат СерверныйФункции.ТурнирнаяТаблица(Чемпионат);
КонецФункции

Функция ПоказыватьРазницуМячей()
	Возврат НаСервереПовторно.ПоказыватьРазницуМячей();
КонецФункции
